In [5]:
import pandas as pd

In [6]:
file = 'https://raw.githubusercontent.com/alamhanz/pandas_journey/main/mydata/food_delivery_datasets.csv' # merujuk link data csv
dataset = pd.read_csv(file, sep=',') #membuka data csv
dataset.head()

,order_id,voucher_amount,date_time,eta_seconds,food_price,cust_id,rating,delivery_fee,resto_id,status,random_id
0,FOOD-10455,0,2018-08-12T20:35:08.001006,1800,18900,1089034,5.0,4000,742638033,Completed,0.511149
1,FOOD-10985,0,2018-09-23T17:44:12.243273,2173,149000,180146,5.0,11000,742767245,Completed,0.832936
2,FOOD-10911,0,2018-09-19T18:08:09.387991,1418,43800,366528,NaN,9000,742618303,Completed,0.828026
3,FOOD-10932,0,2018-09-21T01:24:35.272499,1903,39900,511038,5.0,14000,742541172,Completed,0.239377
4,FOOD-10961,0,2018-09-22T17:57:45.523161,1716,77700,1220358,NaN,4000,742604875,Completed,0.995587

# Rata-rata harga makanan yang menggunakan voucher?

In [9]:
data_1 = dataset[['food_price', 'voucher_amount']] #Menampilkan kolom food price dan voucher amount
data_1.head()

   food_price  voucher_amount
0       18900               0
1      149000               0
2       43800               0
3       39900               0
4       77700               0

In [13]:
data_1.isna().sum() #mengecek missing value

food_price        0
voucher_amount    0
dtype: int64

In [14]:
data_1.describe() #statistika deskriptif data

          food_price  voucher_amount
count    1076.000000     1076.000000
mean    78041.821561     1053.903346
std     58512.508208     3127.726510
min     12900.000000        0.000000
25%     38200.000000        0.000000
50%     59200.000000        0.000000
75%    101100.000000        0.000000
max    448500.000000    25000.000000

In [15]:
df_voucher = data_1[data_1['voucher_amount']>0] #filter data yang menggunakan voucher
df_voucher.head()

    food_price  voucher_amount
8        37500           10000
11       79200            5000
12       56700            3000
16       33100            4000
31       32800           10000

In [16]:
df_voucher['food_price'].mean() #menghitung rata rata harga makanan yang menggunakan voucher

71993.82716049382

In [19]:
df_voucher['food_price'].mode() #mencari nilai modus

0    32100
dtype: int64

# Rata-rata waktu kedatangan yang diberi rating 5

In [21]:
data_2 = dataset[['eta_seconds', 'rating']] #menampilkan kolom eta seconds dan rating
data_2.head()

   eta_seconds  rating
0         1800     5.0
1         2173     5.0
2         1418     NaN
3         1903     5.0
4         1716     NaN

In [22]:
data_2.isna().sum() #menghitung banyaknya missing value

eta_seconds      0
rating         478
dtype: int64

In [23]:
data_2.info() #mengetahui info dari data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1076 entries, 0 to 1075
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   eta_seconds  1076 non-null   int64
 1   rating       598 non-null    float64
dtypes: float64(1), int64(1)
memory usage: 16.9 KB

In [29]:
data_2.dropna(axis=0) #menghapus semua baris yang mengandung missing value

      eta_seconds  rating
0            1800     5.0
1            2173     5.0
3            1903     5.0
5            2344     5.0
6            1449     5.0
...           ...     ...
1068         1655     5.0
1071          900     5.0
1072         1579     5.0
1074         2428     5.0
1075         1547     5.0

[598 rows x 2 columns]

In [30]:
df_rating = data_2[data_2['rating']==5] #filter data yang memiliki rating 5
df_rating.head()

   eta_seconds  rating
0         1800     5.0
1         2173     5.0
3         1903     5.0
5         2344     5.0
6         1449     5.0

In [33]:
rata_rata = df_rating['eta_seconds'].mean() #mencari rata-rata eta seconds

In [35]:
rata_rata/60 #rata-rata eta dalam satuan menit

31.68089430894309